import 'package:flutter/material.dart';
import 'package:flutter_markdown/flutter_markdown.dart';
import 'package:markdown/markdown.dart' as md;



const String _markdownSrc = '''


# __معدل ضربات القلب__:
- في مرحلة الرضاعة (من الولادة إلى سنة واحدة): من 100 إلى 160 ضربة في الدقيقة (وتستقر حول 120 ضربة في الدقيقة خلال أول 30 دقيقة).
- في مرحلة الأطفال الصغار (من 12 شهرًا إلى 36 شهرًا) ومرحلة رياض الأطفال (من 3 إلى 5 سنوات): من 80 إلى 130 ضربة في الدقيقة.
- في مرحلة الأطفال المدرسين (من 6 إلى 12 سنة): من 70 إلى 110 ضربة في الدقيقة.
- في مرحلة المراهقة (من 13 إلى 18 سنة): من 55 إلى 105 ضربة في الدقيقة.
- في مرحلة الشباب المبكر (من 20 إلى 40 سنة): معدل متوسط يبلغ 70 ضربة في الدقيقة.
- في مرحلة منتصف العمر (من 41 إلى 60 سنة): معدل متوسط يبلغ 70 ضربة في الدقيقة.
- في مرحلة المسنين (61 سنة وما فوق): يعتمد على حالة المريض البدنية والصحية.

---

# __كيفية قياس ضغط الدم يدويًا__:
- ارفع الكم على الذراع اليمنى وابحث عن نبضة الشريان.
- ثبت الكفة على الذراع بحيث يكون مركزها فوق نبضة الشريان وفوق الكوع بقليل.
- وضع جهاز الاستيثوسكوب فوق نبضة الشريان ووضع الأجزاء السماعية في أذنيك.
- قم بضخ الكفة بسرعة حتى تصل إلى 200 ثم أخفض تدريجياً الضغط.
- انتبه للصوت الأول الذي يظهر، هذا هو الضغط الانقباضي. واحفظ الصوت الأخير الذي تسمعه، هذا هو الضغط الانبساطي.

---

# __معدل التنفس__:
- في مرحلة الرضاعة (من الولادة إلى سنة واحدة): في البداية من 40 إلى 60 نفسًا في الدقيقة، ومن ثم من 30 إلى 40 نفسًا بعد الدقائق الأولى، ومن 20 إلى 30 نفسًا بحلول عام واحد.
- في مرحلة الأطفال الصغار (من 12 شهرًا إلى 36 شهرًا) ومرحلة رياض الأطفال (من 3 إلى 5 سنوات): من 20 إلى 30 نفسًا في الدقيقة.
- في مرحلة الأطفال المدرسين (من 6 إلى 12 سنة): من 20 إلى 30 نفسًا في الدقيقة.
- في مرحلة المراهقة (من 13 إلى 18 سنة): من 12 إلى 20 نفسًا في الدقيقة.
- في مرحلة الشباب المبكر (من 20 إلى 40 سنة): من 16 إلى 20 نفسًا في الدقيقة (12-20 طبيعي).
- في مرحلة منتصف العمر (من 41 إلى 60 سنة): من 16 إلى 20 نفسًا في الدقيقة (12-20 طبيعي).
- في مرحلة المسنين (61 سنة وما فوق): يعتمد على حالة المريض البدنية والصحية.

# __كيفية قياس معدل التنفس__:
يتم عادة قياس معدل التنفس عندما يكون الشخص في حالة راحة وذلك ببساطة عن طريق عد النفسات لمدة دقيقة وذلك بعد مراقبة كم مرة يرتفع الصدر.

---

# __معدل النبض__:
- في مرحلة الرضاعة (من الولادة إلى سنة واحدة): من 70 عند الولادة إلى 90 عند عام واحد.
- في مرحلة الأطفال الصغار (من 12 شهرًا إلى 36 شهرًا) ومرحلة رياض الأطفال (من 3 إلى 5 سنوات): من 80 إلى 100 ملليمتر زئبقي إلى 110 ملليمتر زئبقي.
- في مرحلة الأطفال المدرسين (من 6 إلى 12 سنة): من 80 إلى 120 ملليمتر زئبقي.
- في مرحلة المراهقة (من 13 إلى 18 سنة): من 100 إلى 120 ملليمتر زئبقي.
- في مرحلة الشباب المبكر (من 20 إلى 40 سنة): متوسط ضغط الدم 120/80 ملليمتر زئبقي.
- في مرحلة منتصف العمر (من 41 إلى 60 سنة): متوسط ضغط الدم 120/80 ملليمتر زئبقي.
- في مرحلة المسنين (61 سنة وما فوق): يعتمد على حالة المريض البدنية والصحية.

# __كيفية قياس معدل النبض__:
- باستخدام إصبعي السبابة والوسطى، ابحث عن شريان الرسغ (بين عظم الزند والوتر) على المعصم الداخلي الأقرب إلى الإبهام وقم بوضع ضغط حتى تشعر بنبض الشريان.
- استمع للنبض لمدة 30 ثانية وضربها بمضاعفة العدد للحصول على عدد النبضات في الدقيقة. وإذا كانت هناك نبضة غير طبيعية، قم بالاستماع لمدة دقيقة كاملة. 

---


# __درجة الحرارة__:
- في مرحلة الرضاعة (من الولادة إلى سنة واحدة): 98-100 درجة فهرنهايت.
- في مرحلة الأطفال الصغار (من 12 شهرًا إلى 36 شهرًا) ومرحلة رياض الأطفال (من 3 إلى 5 سنوات): 96.8-99.6 درجة فهرنهايت.
- في مرحلة الأطفال المدرسين (من 6 إلى 12 سنة): 98.6 درجة فهرنهايت.
- في مرحلة المراهقة (من 13 إلى 18 سنة): 98.6 درجة فهرنهايت.
- في مرحلة الشباب المبكر (من 20 إلى 40 سنة): 98.6 درجة فهرنهايت.
- في مرحلة منتصف العمر (من 41 إلى 60 سنة): 98.6 درجة فهرنهايت.
- في مرحلة المسنين (61 سنة وما فوق): يعتمد على حالة المريض البدنية والصحية.


## __كيفية قياس درجة الحرارة__:
يمكن قياس درجة الحرارة بالفم أو تحت الإبط أو من خلال الشرج باستخدام ميزان حرارة زجاجي تقليدي أو ميزان حرارة رقمي يستخدم مجسًا إلكترونيًا لقياس درجة حرارة الجسم.

---

## __كيفية فحص ضغط الدم__:
الأشخاص الذين يعانون من مرض السكري يفحصون مستويات الجلوكوز في الدم عن طريق نقر أصابعهم باستخدام جهاز قياس مستوى الجلوكوز في الدم أو جهاز مراقبة مستمر للجلوكوز (CGM) لقياس مستوى الجلوكوز في الدم في اللحظة الحالية. استمر في القراءة لمعرفة كيفية استخدام جهاز قياس مستوى الجلوكوز في الدم. لمعرفة المزيد عن أجهزة CGM، ابدأ بالتحدث مع طبيبك.


## __كيفية استخدام جهاز قياس مستوى الجلوكوز في الدم__:
1. بعد غسل يديك، قم بإدخال شريط الاختبار في جهاز القياس الخاص بك.
2. استخدم جهاز اللدغ على جانب إصبعك للحصول على قطرة من الدم.
3. اضغط واحتفظ بحافة شريط الاختبار على القطرة من الدم وانتظر النتيجة.
4. ستظهر قيمة مستوى الجلوكوز في الدم على شاشة الجهاز.

---

# __جدول ضغط الدم حسب الفئة العمرية__:
## __الحد الأدنى__:
| الفئة العمرية | ضغط الدم |
| --- | --- |
| من سنة واحدة إلى 12 شهرًا | 75/50 |
| من سنة واحدة إلى 5 سنوات | 80/55 |
| من 6 إلى 13 سنة | 90/60 |
| من 14 إلى 19 سنة | 105/73 |
| من 20 إلى 24 سنة | 108/75 |
| من 25 إلى 29 سنة | 109/76 |
| من 30 إلى 34 سنة | 110/77 |
| من 35 إلى 39 سنة | 111/78 |
| من 40 إلى 44 سنة | 112/79 |
| من 45 إلى 49 سنة | 115/80 |
| من 50 إلى 54 سنة | 116/81 |
| من 55 إلى 59 سنة | 118/82 |
| من 60 إلى 64 سنة | 121/83 |

## __النطاق الطبيعي__:
| الفئة العمرية | ضغط الدم |
| --- | --- |
| من سنة واحدة إلى 12 شهرًا | 90/60 |
| من سنة واحدة إلى 5 سنوات | 95/65 |
| من 6 إلى 13 سنة | 105/70 |
| من 14 إلى 19 سنة | 117/77 |
| من 20 إلى 24 سنة | 120/79 |
| من 25 إلى 29 سنة | 121/80 |
| من 30 إلى 34 سنة | 122/81 |
| من 35 إلى 39 سنة | 123/82 |
| من 40 إلى 44 سنة | 125/83 |
| من 45 إلى 49 سنة | 127/84 |
| من 50 إلى 54 سنة | 129/85 |
| من 55 إلى 59 سنة | 131/86 |
| من 60 إلى 64 سنة | 134/87 |

## __الحد الأقصى__:
| الفئة العمرية | ضغط الدم |
| --- | --- |
| من سنة إلى 12 شهرًا | 110/75 |
| من سنة إلى 5 سنوات | 110/79 |
| من 6 إلى 13 سنة | 115/80 |
| من 14 إلى 19 سنة | 120/81 |
| من 20 إلى 24 سنة | 132/83 |
| من 25 إلى 29 سنة | 133/84 |
| من 30 إلى 34 سنة | 134/85 |
| من 35 إلى 39 سنة | 135/86 |
| من 40 إلى 44 سنة | 137/87 |
| من 45 إلى 49 سنة | 139/88 |
| من 50 إلى 54 سنة | 142/89 |
| من 55 إلى 59 سنة | 144/90 |
| من 60 إلى 64 سنة | 147/91 | 


''';

class VitalSign extends StatelessWidget {
  const VitalSign({super.key});

  @override
  Widget build(BuildContext context) {

    final styleSheet = MarkdownStyleSheet(
      // You can customize various text styles here
      h1: TextStyle(fontSize: 24.0), // Increase font size for header 1
      h2: TextStyle(fontSize: 20.0), // Increase font size for header 2
      // Add more styles for other elements as needed
    );
    return Scrollbar(
      child: Markdown(
        styleSheet: styleSheet, // Apply the custom style sheet
        data: _markdownSrc,
        onTapLink: (text, href, title) => {},
        selectable: true,
        // syntaxHighlighter: _MyDartSyntaxHighligher(),
        //// We use [GitHub flavored Markdown]: https://github.github.com/gfm/.
        extensionSet: md.ExtensionSet(
          /*blockSyntaxes=*/ md.ExtensionSet.gitHubFlavored.blockSyntaxes,
          /*inlineSyntaxes=*/ md.ExtensionSet.gitHubFlavored.inlineSyntaxes,
        ),
      ),
    );

  }
}
